{
  "ClipModule": {
    "device": "cuda",
    "data_type": "float16",
    "tokenizer_config": {
      "vocab_file": "/data/yhc/stable-diffusion-v1-5/tokenizer/vocab.json",
      "merges_file": "/data/yhc/stable-diffusion-v1-5/tokenizer/merges.txt",
      "model_max_length": 77
    },
    "parameter_path": "/data/yhc/stable-diffusion-v1-5/text_encoder/yhc_saved_pytorch_model.bin",
    "text_encoder_config": {
      "clip_text_config_path": "/data/yhc/stable-diffusion-v1-5/text_encoder"
    }
  },
  "UNetModule": {
    "device": "cuda",
    "data_type": "float16",
    "avg_loop_count": 40,
    "scheduler_config": {
      "num_train_timesteps": 1000,
      "beta_start": 0.00085,
      "beta_end": 0.012,
      "beta_schedule": "scaled_linear",
      "trained_betas": null,
      "prediction_type": "epsilon",
      "skip_prk_steps": true,
      "set_alpha_to_one": false,
      "steps_offset": 1,
      "_class_name": "PNDMScheduler",
      "_diffusers_version": "0.6.0",
      "clip_sample": false
    },
    "unet_config": {
      "sample_size": 64,
      "down_block_types": [
        "CrossAttnDownBlock2D",
        "CrossAttnDownBlock2D",
        "CrossAttnDownBlock2D",
        "DownBlock2D"
      ],
      "mid_block_type": "UNetMidBlock2DCrossAttn",
      "up_block_types": [
        "UpBlock2D",
        "CrossAttnUpBlock2D",
        "CrossAttnUpBlock2D",
        "CrossAttnUpBlock2D"
      ],
      "cross_attention_dim": 768
    },
    "parameter_path": "/data/yhc/stable-diffusion-v1-5/unet/diffusion_pytorch_model.bin"
  },
  "VaeModule": {
    "device": "cuda",
    "data_type": "float16",
    "vae_config": {
      "in_channels": 3,
      "out_channels": 3,
      "down_block_types": [
        "DownEncoderBlock2D",
        "DownEncoderBlock2D",
        "DownEncoderBlock2D",
        "DownEncoderBlock2D"
      ],
      "up_block_types": [
        "UpDecoderBlock2D",
        "UpDecoderBlock2D",
        "UpDecoderBlock2D",
        "UpDecoderBlock2D"
      ],
      "block_out_channels": [
        128,
        256,
        512,
        512
      ],
      "layers_per_block": 2,
      "act_fn": "silu",
      "latent_channels": 4,
      "norm_num_groups": 32,
      "scaling_factor": 0.18215
    },
    "parameter_path": "/data/yhc/stable-diffusion-v1-5/vae/diffusion_pytorch_model.bin"
  },
  "SafetyModule": {
    "device": "cuda",
    "data_type": "float16",
    "feature_extractor_config": {
      "crop_size": 224,
      "do_center_crop": true,
      "do_convert_rgb": true,
      "do_normalize": true,
      "do_resize": true,
      "image_mean": [
        0.48145466,
        0.4578275,
        0.40821073
      ],
      "image_std": [
        0.26862954,
        0.26130258,
        0.27577711
      ],
      "resample": 3,
      "size": 224
    },
    "safety_checker_config": {
      "config_path": "/data/yhc/stable-diffusion-v1-5/safety_checker/config.json",
      "parameter_path": "/data/yhc/stable-diffusion-v1-5/safety_checker/yhc_saved_safety_checker.bin"
    },
    "parameter_path": "/data/yhc/stable-diffusion-v1-5/safety_checker/yhc_saved_safety_checker.bin"
  }
}